app/views/shared/_user_info.html.erb

SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<span class="user-name1">
  <%= pluralize(current_user.microposts.count, "Message") %>